Project/Toir.Adaptation/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b23ddd04-6d70-49d8-a27c-cf8169874579">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37d6bc6d-0833-419f-b341-b8dea598faf1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4c3bfad-e541-47e8-9005-fa8a9857cba5">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4a678fd-1266-4080-b919-06a2d79fae8a">
    <name>гкс_РежимРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe14a8d2-1944-4f1e-b299-7a9b0223ef28">
    <name>гкс_ОсобыеУсловия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41e7789d-5d85-460d-be8f-8fc2b293bbbd">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5e090819-3bf8-4a64-a7d2-0ab585ce4316">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="449da75b-fa30-4096-8fb8-e00acceca535">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d01a746a-1f60-452d-b092-1ead64a66198">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6a0ca5c1-fbd3-4c7e-bdde-3fb81c617b0a">
    <name>Исполнители</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c1ae9921-70cf-481b-885a-5b0ab42e254a">
      <name>гкс_ВремяРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0701d7e4-cb55-4f74-aab5-bcfc142200b6">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aa8b8405-de2a-40f9-abcf-463c138ba33a">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="64107450-ce42-48a3-b3d7-cdbfefb4f781">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="98f1156a-550e-4650-b792-f2b9616909e1">
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8aaffcc0-63ff-47b9-a8dd-73e848c02a69">
    <name>ИсполнителиПоРемонтам</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="189fe98f-02ff-434b-8b7f-6878c66dd57f">
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d0f7b50e-67c4-42a9-bec6-d0b463a7e599">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="45c58294-ca52-48e5-8e27-dc256cfa6f69">
    <name>Ответственные</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="81d9731d-7525-44cf-a76c-86ef23d1326c">
      <name>ОтветственноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aea61b3d-2bc1-41bd-8f3b-9930526732fe">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="84523221-6fd9-44b8-844b-b7c13eb9186f">
    <name>РемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a0d60cce-1bb8-48f6-90eb-d8a28e097c3e">
      <name>гкс_Огневая</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be7d6060-9f1e-428b-9ff8-f010677244f7">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="db8f9a67-aa24-4337-913e-55cf61e11ff6">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d4d1ad7a-8eb6-4821-b1b8-09da6816b24e">
      <name>РемонтнаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7cd36bfa-c12e-4642-be55-83b9067704c7">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/гкс_НомераНарядДопусков/гкс_НомераНарядДопусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6ca9236f-a7cf-49a5-8e0b-1034fbae926d">
  <name>гкс_НомераНарядДопусков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7ff0936e-6bc1-4e13-9e44-af9f89a0899d">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a6c59d4f-57e8-4846-ae58-2731caec3ab2">
    <name>НомерТекст</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="0c308af0-2ff5-4e40-9f19-94e8db40752d">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ОтветственныеЛица/торо_ОтветственныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7ec5414d-f243-49d4-9141-3cf33dff4ba4">
  <name>торо_ОтветственныеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="2ad779cc-e898-4714-89f3-913d5d8962cc">
    <name>Допускающий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1c938446-cafc-4fd4-aa35-5fd5c683da1a">
    <name>РуководительРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="24c490e1-26a7-4c13-b459-88689191d610">
    <name>ИсполнительРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6c333df0-922d-4af0-bf02-7b5db995bcd7">
    <name>ОтветственныйЗаПодготовкуОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="10db7b9e-5a69-4cf4-b6e3-5a2dbb4c1507">
    <name>Наряд_допускВыдал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура гкс_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	ФоИнтеграцияСПромБезопасностью = ПолучитьФункциональнуюОпцию("торо_ИнтеграцияСПромБезопасностью");
	ЕстьОпасныеРаботы = Ложь;
	Если ФоИнтеграцияСПромБезопасностью = Истина Тогда
		Для каждого текСтрока из РемонтыОборудования Цикл
			Если текСтрока.ОпаснаяРабота Тогда
				ЕстьОпасныеРаботы = Истина;
				Если Не ЗначениеЗаполнено(текСтрока.МестоПроведенияРабот) Тогда
					ШаблонСообщения = НСтр("es='En la parte tabular ""los Trabajos de reparación"" en la línea № %1 no es rellenado el campo ""el Lugar de la realización de los trabajos"", para los trabajos peligrosos este campo debe ser rellenado. La realización del documento era anulada.';ru='В табличной части ""Ремонтные работы"" в строке №%1 не заполнено поле ""Место проведения работ"", для опасных работ это поле должно быть заполнено. Проведение документа было отменено.';en='In the tabular part ""Repair work"" in line No.%1 the field ""Work Location"" is not filled, for hazardous work this field must be filled. The document has been canceled.'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, текСтрока.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		масРолей = Новый Массив;

		Если ЕстьОпасныеРаботы Тогда
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.Допускающий);
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта);
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.РуководительРабот);
		Иначе
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.Допускающий);
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.ОтветственныйЗаПодготовкуОбъекта);
			масРолей.Добавить(Перечисления.торо_ОтветственныеЛица.Наблюдающий);
		КонецЕсли;

		#Удаление
		ЕстьВсеНужныеРоли = ПроверитьНаличиеНеобходимыхРолей(масРолей, Ответственные, ЕстьОпасныеРаботы);

		Если НЕ ЕстьВсеНужныеРоли Тогда 
			Отказ = Истина;
		КонецЕсли;
		#КонецУдаления
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Ответственные.Сотрудник");
		МассивНепроверяемыхРеквизитов.Добавить("Ответственные.ОтветственноеЛицо");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	ПроверитьДублиИсполнителей(Отказ);

	СписокТЧ = Новый Структура();
	СписокТЧ.Вставить("РемонтыОборудования", "Ремонты оборудования");
	СписокТЧ.Вставить("РемонтныеРаботы", "Ремонтные работы");

	ШаблонСообщения = НСтр("es='En la parte tabular ""%1"" no hay líneas.';ru='В табличной части ""%1"" нет строк.';en='There are no rows in the table part ""%1"".'");
	Для каждого текТЧ из СписокТЧ Цикл
		Если ЭтотОбъект[ТекТЧ.Ключ].Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекТЧ.Значение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЦикла;

	// Проверить заполнение ТЧ
	ПроверитьЗаполнениеТабличнойЧастиРемонтыОборудования(Отказ);
	ПроверитьЗаполнениеТабличнойЧастиРемонтныеРаботы(Отказ);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура гкс_ОбработкаЗаполнения(Основание, СтандартнаяОбработка)

	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание, ЭтотОбъект);	

		// Вызывается из формы операций без нарядов, актуально для опасных работ.

		Для каждого Строка Из Основание.РемонтыОборудования Цикл
			НС = РемонтыОборудования.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Строка);
			НС.ВидРемонтныхРабот = Строка.ВидРемонта;
			НС.ДокументИсточник = Основание.Основание;
			НС.ДатаНачала = Строка.ДатаНачалаРемонта;
			НС.ДатаОкончания = Строка.ДатаОкончанияРемонта;
		КонецЦикла; 

		Если Основание.Свойство("ИзНормативов") И Основание.ИзНормативов = Истина Тогда
			торо_Ремонты.ЗаполнитьРемонтныеРаботыПоНормативам(ЭтотОбъект, "РемонтыОборудования", "РемонтныеРаботы");
		Иначе
			Для каждого Стр Из Основание.МассивРемонтов Цикл
				НС = РемонтныеРаботы.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Стр);
			КонецЦикла;
		КонецЕсли; 

		Если Основание.Свойство("ОпасныеРаботы") И Основание.ОпасныеРаботы = Истина Тогда
			ВыводФормыПодбораПриОткрытии = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Основание) = Тип("Соответствие") Тогда

		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание, ЭтотОбъект);	
		торо_ЗаполнениеДокументов20.ЗаполнитьДокументНаОсновании(Основание, ЭтотОбъект);

	ИначеЕсли Основание <> Неопределено Тогда

		Отказ = Ложь;
		торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(Основание, Отказ, Ложь);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;

		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание, ЭтотОбъект);	

		ИмяТЧ = торо_Ремонты.ПолучитьИмяТЧРемонтов(Основание);

		Неотмененный = торо_ЗаполнениеДокументов.ВернутьIDНеотмененногоРемонта(Основание, Основание[ИмяТЧ]);
		Если ИмяТЧ <> Неопределено И Неотмененный <> "" Тогда
			СоответствиеИДДокументам = Новый Соответствие;
			СоответствиеИДДокументам.Вставить(Неотмененный, Основание);   
			торо_ЗаполнениеДокументов20.ЗаполнитьДокументНаОсновании(СоответствиеИДДокументам, ЭтотОбъект);
		Иначе
			торо_ЗаполнениеДокументов20.ЗаполнитьДокументыОснования(Основание, ЭтотОбъект);
		КонецЕсли; 
	Иначе
		торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(Основание, ЭтотОбъект);	
	КонецЕсли;
	#Вставка
	Если ДокументыОснования.Количество() Тогда 
		МассивСмет = Новый Массив();
		Для Каждого СТ Из ДокументыОснования Цикл
			Если ТипЗнч(СТ.ДокументОснование) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда 
				МассивСмет.Добавить(СТ.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		Если МассивСмет.Количество() Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Док.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.торо_ЗаявкаНаРемонт КАК Док
				|ГДЕ
				|	Док.гкс_РаботаПовышеннойОпасности = ""Да""
				|	И Док.Ссылка В(&МассивСмет)";
			
			Запрос.УстановитьПараметр("МассивСмет", МассивСмет);
			
			РезультатЗапроса = Запрос.Выполнить();
	 		гкс_ОформитьНарядДопуск = Не РезультатЗапроса.Пустой();
		КонецЕсли;
	КонецЕсли;
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
Процедура гкс_ПриЗаписи(Отказ)

	Если РемонтныеРаботы.Количество() > 0 Тогда
		Если Не ЗначениеЗаполнено(РемонтныеРаботы[0].ID) Тогда
			РемонтныеРаботы.Очистить();
		КонецЕсли;
	КонецЕсли;

	#Вставка
	ИндексПервогоЭлементаНабораЗаписейРегистраСведений = 0;
	НаборЗаписей = РегистрыСведений.гкс_НомераНарядДопусков.СоздатьнаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	Если гкс_ОформитьНарядДопуск Тогда 
		ТекГод = НачалоГода(Дата);
		НаборЗаписей.Прочитать();
		НужноИзменить = Истина;
		Если НаборЗаписей.Количество() Тогда 
			НужноИзменить = Не (НаборЗаписей[ИндексПервогоЭлементаНабораЗаписейРегистраСведений].Год = ТекГод 
			И НаборЗаписей[ИндексПервогоЭлементаНабораЗаписейРегистраСведений].Подразделение = Подразделение);
		КонецЕсли;
		Если НужноИзменить Тогда 
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			Запрос = Новый Запрос();
			Запрос.Текст = "Выбрать Максимум(ТЧ.Номер) КАК Номер 
			|ИЗ РегистрСведений.гкс_НомераНарядДопусков КАК ТЧ 
			|Где ТЧ.Подразделение = &Подр 
			|И ТЧ.Год = &Год";
			Запрос.УстановитьПараметр("Подр", Подразделение);
			Запрос.УстановитьПараметр("Год", ТекГод);
			РезультатЗапроса = Запрос.Выполнить();
			ПоследнийНомер = 0;
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Номер) Тогда 
				ПоследнийНомер = Выборка.Номер;
			КонецЕсли;
			ПоследнийНомер = ПоследнийНомер + 1;
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.Номер = ПоследнийНомер;
			НоваяСтрока.НомерТекст = Формат(НоваяСтрока.Номер, "ЧГ=0");
			Пока СтрДлина(НоваяСтрока.НомерТекст) < 11 Цикл
				НоваяСтрока.НомерТекст = "0" + НоваяСтрока.НомерТекст;
			КонецЦикла;
			НоваяСтрока.Год = ТекГод;
			НоваяСтрока.Подразделение = Подразделение;
			НоваяСтрока.Документ = Ссылка;
			НаборЗаписей.Записать();
		КонецЕсли;
	Иначе
		НаборЗаписей.Записать();
	КонецЕсли;
	#КонецВставки
КонецПроцедуры
